<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class EducationProgramsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $programs = $programs = [
            [
                'faculty' => 'Аграрный институт',
                'code' => '35.03.04',
                'name' => 'Агрономия',
            ],
            [
                'faculty' => 'Аграрный институт',
                'code' => '36.05.01',
                'name' => 'Ветеринария',
            ],
            [
                'faculty' => 'Аграрный институт',
                'code' => '36.03.02',
                'name' => 'Зоотехния',
            ],
            [
                'faculty' => 'Аграрный институт',
                'code' => '35.03.10',
                'name' => 'Ландшафтная архитектура',
            ],
            [
                'faculty' => 'Аграрный институт',
                'code' => '19.03.03',
                'name' => 'Продукты питания животного происхождения',
            ],
            [
                'faculty' => 'Институт архитектуры и строительства',
                'code' => '07.03.01',
                'name' => 'Архитектура',
            ],
            [
                'faculty' => 'Институт архитектуры и строительства',
                'code' => '08.03.01',
                'name' => 'Строительство',
            ],
            [
                'faculty' => 'Институт архитектуры и строительства',
                'code' => '08.05.01',
                'name' => 'Строительство уникальных зданий и сооружений',
            ],
            [
                'faculty' => 'Институт геоинформационных технологий и географии',
                'code' => '05.03.02',
                'name' => 'География',
            ],
            [
                'faculty' => 'Институт геоинформационных технологий и географии',
                'code' => '21.03.02',
                'name' => 'Землеустройство и кадастры',
            ],
            [
                'faculty' => 'Институт геоинформационных технологий и географии',
                'code' => '05.03.03',
                'name' => 'Картография и геоинформатика',
            ],
            [
                'faculty' => 'Институт геоинформационных технологий и географии',
                'code' => '43.03.02',
                'name' => 'Туризм',
            ],
            [
                'faculty' => 'Институт геоинформационных технологий и географии',
                'code' => '05.03.06',
                'name' => 'Экология и природопользование',
            ],
            [
                'faculty' => 'Институт механики и энергетики',
                'code' => '35.03.06',
                'name' => 'Агроинженерия',
            ],
            [
                'faculty' => 'Институт механики и энергетики',
                'code' => '13.03.01',
                'name' => 'Теплоэнергетика и теплотехника',
            ],
            [
                'faculty' => 'Институт механики и энергетики',
                'code' => '20.03.01',
                'name' => 'Техносферная безопасность',
            ],
            [
                'faculty' => 'Институт механики и энергетики',
                'code' => '23.03.03',
                'name' => 'Эксплуатация транспортно-технологических машин и комплексов',
            ],
            [
                'faculty' => 'Институт механики и энергетики',
                'code' => '13.03.02',
                'name' => 'Электроэнергетика и электротехника',
            ],
            [
                'faculty' => 'Институт наукоемких технологий и новых материалов',
                'code' => '11.05.01',
                'name' => 'Радиоэлектронные системы и комплексы',
            ],
            [
                'faculty' => 'Институт наукоемких технологий и новых материалов',
                'code' => '12.03.03',
                'name' => 'Фотоника и оптоинформатика',
            ],
            [
                'faculty' => 'Институт наукоемких технологий и новых материалов',
                'code' => '04.05.01',
                'name' => 'Фундаментальная и прикладная химия',
            ],
            [
                'faculty' => 'Институт наукоемких технологий и новых материалов',
                'code' => '18.03.01',
                'name' => 'Химическая технология',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '52.05.01',
                'name' => 'Актерское искусство',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '51.03.06',
                'name' => 'Библиотечно-информационная деятельность',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '53.03.04',
                'name' => 'Искусство народного пения',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '42.03.05',
                'name' => 'Медиакоммуникации',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '51.03.02',
                'name' => 'Народная художественная культура',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '44.03.01',
                'name' => 'Педагогическое образование',
            ],
            [
                'faculty' => 'Институт национальной культуры',
                'code' => '42.03.01',
                'name' => 'Реклама и связи с общественностью',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '11.03.02',
                'name' => 'Инфокоммуникационные технологии и системы связи',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '09.03.01',
                'name' => 'Информатика и вычислительная техника',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '10.03.01',
                'name' => 'Информационная безопасность',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '12.03.02',
                'name' => 'Оптотехника',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '43.03.01',
                'name' => 'Сервис',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '27.03.01',
                'name' => 'Стандартизация и метрология',
            ],
            [
                'faculty' => 'Институт электроники и светотехники',
                'code' => '11.03.04',
                'name' => 'Электроника и наноэлектроника',
            ],
            [
                'faculty' => 'Историко-социологический институт',
                'code' => '46.03.01',
                'name' => 'История',
            ],
            [
                'faculty' => 'Историко-социологический институт',
                'code' => '41.03.04',
                'name' => 'Политология',
            ],
            [
                'faculty' => 'Историко-социологический институт',
                'code' => '37.03.01',
                'name' => 'Психология',
            ],
            [
                'faculty' => 'Историко-социологический институт',
                'code' => '39.03.02',
                'name' => 'Социальная работа',
            ],
            [
                'faculty' => 'Историко-социологический институт',
                'code' => '39.03.01',
                'name' => 'Социология',
            ],
            [
                'faculty' => 'Медицинский институт',
                'code' => '31.05.01',
                'name' => 'Лечебное дело',
            ],
            [
                'faculty' => 'Медицинский институт',
                'code' => '31.05.02',
                'name' => 'Педиатрия',
            ],
            [
                'faculty' => 'Медицинский институт',
                'code' => '31.05.03',
                'name' => 'Стоматология',
            ],
            [
                'faculty' => 'Медицинский институт',
                'code' => '33.05.01',
                'name' => 'Фармация',
            ],
            [
                'faculty' => 'Рузаевский институт машиностроения',
                'code' => '15.03.04',
                'name' => 'Автоматизация технологических процессов и производств',
            ],
            [
                'faculty' => 'Рузаевский институт машиностроения',
                'code' => '15.03.05',
                'name' => 'Конструкторско-технологическое обеспечение машиностроительных производств',
            ],
            [
                'faculty' => 'Факультет биотехнологии и биологии',
                'code' => '06.05.01',
                'name' => 'Биоинженерия и биоинформатика',
            ],
            [
                'faculty' => 'Факультет биотехнологии и биологии',
                'code' => '06.03.01',
                'name' => 'Биология',
            ],
            [
                'faculty' => 'Факультет биотехнологии и биологии',
                'code' => '19.03.01',
                'name' => 'Биотехнология',
            ],
            [
                'faculty' => 'Факультет иностранных языков',
                'code' => '45.03.02',
                'name' => 'Лингвистика',
            ],
            [
                'faculty' => 'Факультет иностранных языков',
                'code' => '45.05.01',
                'name' => 'Перевод и переводоведение',
            ],
            [
                'faculty' => 'Факультет математики и информационных технологий',
                'code' => '01.03.02',
                'name' => 'Прикладная математика и информатика',
            ],
            [
                'faculty' => 'Факультет математики и информационных технологий',
                'code' => '09.03.04',
                'name' => 'Программная инженерия',
            ],
            [
                'faculty' => 'Факультет математики и информационных технологий',
                'code' => '02.03.02',
                'name' => 'Фундаментальная информатика и информационные технологии',
            ],
            [
                'faculty' => 'Филологический факультет',
                'code' => '42.03.02',
                'name' => 'Журналистика',
            ],
            [
                'faculty' => 'Филологический факультет',
                'code' => '45.03.01',
                'name' => 'Филология',
            ],
            [
                'faculty' => 'Экономический институт',
                'code' => '38.03.02',
                'name' => 'Менеджмент',
            ],
            [
                'faculty' => 'Экономический институт',
                'code' => '01.03.05',
                'name' => 'Статистика',
            ],
            [
                'faculty' => 'Экономический институт',
                'code' => '27.03.02',
                'name' => 'Управление качеством',
            ],
            [
                'faculty' => 'Экономический институт',
                'code' => '38.03.01',
                'name' => 'Экономика',
            ],
            [
                'faculty' => 'Экономический институт',
                'code' => '38.05.01',
                'name' => 'Экономическая безопасность',
            ],
            [
                'faculty' => 'Юридический институт',
                'code' => '40.05.02',
                'name' => 'Правоохранительная деятельность',
            ],
            [
                'faculty' => 'Юридический институт',
                'code' => '40.03.01',
                'name' => 'Юриспруденция',
            ],
        ];
        foreach ($programs as $program){
            DB::table('education_programs')->insert([
                'code'=>$program['code'],
                'name'=>$program['name'],
                'faculty'=>$program['faculty']
            ]);
        }
    }
}
